;-----------------------------------------------------------
;定义输入输出的起始地址方法，定义到第一个地址就行了;(拓展的要求是修改输入输出接口)
;-----------------------------------------------------------
PortIn	EQU	80h	;定义输入端口号
PortOut	EQU	88h	;定义输出端口号


;-----------------------------------------------------------
;代码主干部分
;输出的方法 MOV AX 数据;MOV DX 端口;OUT DX,AX;     #要会哟#                   
;-----------------------------------------------------------
MOV CX,6;循环，亮和不亮是完全对称的两段，间隔要比DELAY1小
LOOP1:MOV AL,33H;NS绿EW红
      MOV DX,PortOut;
      OUT DX,AL;
      CALL Delay2;
      
      MOV AL,37H;NS不亮EW红
      MOV DX,PortOut;
      OUT DX,AL;
      CALL Delay2;
      
LOOP2:DEC CX;这里可以直接用一句LOOP
      JNZ LOOP1;

;-----------------------------------------------------------
;DELAY1子程序：子程序怎么写要掌握 #要会哟#   ：开始，结尾，跳出，保存循环 几个东西             
;要人工保存第一次计数的值：先PUSH再POP  
;这里用的是时钟周期，CX的取值比较大
;-----------------------------------------------------------
DELAY1 	PROC                    ;开始：名字 PROC
    	PUSH CX
    	MOV CX,DelayLong	
D0: 	LOOP D0
    	POP CX
    	RET                     ;因为是子程序，里面要写RET
DELAY1 	ENDP                    ;结尾：名字 ENDP

;-----------------------------------------------------------
;	定义数据段 注意用的是DW                                             |
;-----------------------------------------------------------
		.data					; 定义数据段
DelayShort	dw	4000			; 短延时参量	
DelayLong	dw	40000			; 长延时参量
DelayYellow	dw	20000			; 长延时参量


		END	Main				;指示汇编程序结束编译
